
* DONE 壳牌北邮站布线包管测量
:LOGBOOK:
  CLOCK: [2021-03-25 四 13:48]--[2021-03-25 四 13:49] =>  0:01
  :END:
  [2021-03-25 四 13:48]
  [[file:~/.emacs.d/jincai-emacs.org::*Jincai'%20Emacs%20configurations][Jincai' Emacs configurations]]
* DONE 新冠肺炎疫苗第二针注射
  [2021-03-26 五 14:41]
** DONE 螺丝
   京东今天配送
   :LOGBOOK:
   CLOCK: [2021-03-25 四 13:39]--[2021-03-25 四 13:40] =>  0:01
   :END:
   [2021-03-25 四 13:39]
  

** TODO network study
   DEADLINE: <2021-04-30 五> SCHEDULED: <2021-03-11 四>
   #+BEGIN: clocktable :maxlevel 2 :scope subtree
   #+CAPTION: Clock summary at [2021-03-12 五 11:21]
   | Headline     | Time   |
   |--------------+--------|
   | *Total time* | *0:00* |
   #+END:

   :PROPERTIES:
   :STYLE: habit
   :REPEAT_TO_STATE: NEXT
   :END:

    baidu netdisk :ccna，ccnp, to study!!!

    
***** DONE 华瑞大厦手续

      第三方需要填得表格
      公司需要提供设备安装得许可
      :LOGBOOK:
      CLOCK: [2021-03-25 四 13:41]--[2021-03-25 四 13:42] =>  0:01
      :END:
      [2021-03-25 四 13:41]
      [[file:~/.emacs.d/org-file/refile.org::*%E9%80%81%E8%9E%BA%E4%B8%9D][送螺丝]]
* NEXT 基金

交银鸿光一年混合A 011256   10w
前海开源聚慧三年持有混合 011287  10w
易方达裕丰回报债券 000171 5w
中银多策略灵活配置A 000572 3w


[2021-03-30 二 10:27]

SCHEDULED: <2021-03-30 二 .+1d/3d>
:PROPERTIES:
:STYLE: habit
:REPEAT_TO_STATE: NEXT
:END:
* WAITING 积分       "WAITING"    from "NEXT"       
  [2021-03-30 二 16:55]
  每周五 9：00 交行信用卡
  最红5积分，交行，周五
  [2021-03-30 二 10:54]
PEAT_TO_STATE: NEXT
:END:
* DONE 布线进场
周3,华瑞
周4,天坛
周5,北斗星通
  :LOGBOOK:
  CLOCK: [2021-03-30 二 16:54]--[2021-03-30 二 16:54] =>  0:00
  :END:
[2021-03-30 二 16:54]
** DONE 取阀兰
   回龙观
   :LOGBOOK:
   CLOCK: [2021-04-07 三 10:48]--[2021-04-07 三 10:49] =>  0:01
   :END:
 [2021-04-07 三 10:48]
** DONE 北斗楼顶施工
   :LOGBOOK:
   CLOCK: [2021-04-07 三 10:57]--[2021-04-07 三 10:57] =>  0:00
   :END:
 [2021-04-07 三 10:57]
 [[file:~/.emacs.d/org-file/refile.org::*%E5%8F%91%E7%A5%A8][发票
 ]]
** DONE 贴标
   华瑞完成
   北斗大厦完成
   天坛
     铺垫
     贴标
     固定避雷针
   :LOGBOOK:
   CLOCK: [2021-04-08 四 11:33]--[2021-04-08 四 11:34] =>  0:01
   :END:
* DONE 发票
  
  还差配重块，玻璃胶，扳手
[2021-04-07 三 10:56]
* linux文件乱码处理办法:
  通过inode修改cd
  sudo find . -inum 283766357 -exec convmv -f gbk -t  utf-8 --notest {} \
  :LOGBOOK:
  CLOCK: [2021-04-13 二 12:10]--[2021-04-14 三 10:16] => 22:06
  :END:
  [2021-04-13 二 12:10]
  amarok中文乱码解决
  mid3iconv *.mp3 -e gbk
  convmv -f gbk -t utf-8 --notest *.mp3

  [2021-04-14 三 10:16]
*  :NOTE:新能源能量密度
  北汽2000款eu5 
  车型BJ7000C5DC-BEV 180.05Wh/kg //车辆数据表
  车型BJ7000c5d3-BEV 140Wh/kg
  北汽eu7 144.4Wh/kg
  :LOGBOOK:
  CLOCK: [2021-05-06 四 14:53]
  :END:
[2021-05-06 四 14:53]
* TODO ros安装与测试

  wiki install
  ros update timeout 解决

  更改 /usr/lib/python3/dist-packages/rosdep2下的三个文件sources_list.py、gbpdistro_support.py、rep3.py
  中的DOWNLOAD_TIMEOUT = 15.0值，改大一点就可以了。


  第一步，打开一个终端测试roscore是否能正常启动，使用ROS必须保证roscore运行：
  $ roscore
  第二步，新开启一个终端，执行以下命令：
  
  $ rosrun turtlesim turtlesim_node
  第三步，再开启一个终端，执行以下命令：

  $ rosrun turtlesim turtle_teleop_key
  
  [2021-05-26 三 10:47]

